app/Http/Controllers/OrderController.php

insert into `order` (`Order_Id`, `Total`, `Cus_Name`, `Cus_Phone`, `Staff_Id`, `Recipient_Name`, `Recipient_Phone`, `Recipient_Email`, `Recipient_Province_City`, `Recipient_District`, `Recipient_Ward`, `Recipient_Address`, `Note`, `Create_Date`, `Payment_Code`) values ('Od11', 151000, 'Nguyễn Nhàn ABC', '0384683134', 'S0201115', 'Vũ Nhận Hàng', '0384683133', 'vugiakhang85@gmail.com', 'Hồ Chí Minh', 'Thủ Đức', 'Linh Chiểu', '37 Đường 17', 'Giao trong giờ hành chính', '2024-04-06 17:29:00', 'cash')
---
                            'Create_Date'=>$request['created_date'],
                            'Payment_Code'=>$request['payment_list.0.payment_code']
                    ];
                    Order1::Create($orderData);

select `Pd_Name` from `product` where `Pd_id` = 'P01'
insert into `order_detail` (`Order_Detail_Id`, `Order_Id`, `Pd_Id`, `Quantity`, `Prm_Id`, `Prm_Disc`, `Org_Price_P`, `AfterPrm_Price_P`, `AfterPrm_Total`, `Pd_Name`) values ('O14', 'Od11', 'P01', 1, 'KM01', 20, 560000, 448000, 448000, '[\"Lily\'s Valley\"]')
delete from `detail_count` where `count` = 14
insert into `detail_count` (`count`) values (15)
---
                            'AfterPrm_Price_P'=>$item['AfterPrm_Price_P'],
                            'AfterPrm_Total'=>$item['AfterPrm_Price_Total']
                        ];
                        $Pd_Name = Product::where('Pd_id','=',$item['Pd_Id'])->pluck('Pd_Name');
                        $order_detailData['Pd_Name']=$Pd_Name;
                        Order_Detail::create($order_detailData);
                        Detail_Count::where('count','=',$detail_count)->delete();
                        $detail_count_new=$detail_count+1;
                        Detail_Count::create(['count' => $detail_count_new]);