app/Http/Controllers/ProductController.php

    public function discountedProducts()
    {
        $promotions = Promotion::where('Prm_StDate', '<=', now())
            ->where('Prm_EnDate', '>=', now())
            ->get();
---
select * from `promotion` where `Prm_StDate` <= '2024-04-07 10:04:31' and `Prm_EnDate` >= '2024-04-07 10:04:31'