app/Http/Controllers/admin/account.php

function customer()
    {
        $customer = DB::table("customer")->get();
---
select * from `customer`