app/Http/Controllers/admin/main.php

function setting()
    {
        $signin = DB::table("login")->whereRaw("phone=?",[Auth::user()->phone])->first();
        $info = DB::table("admin")->whereRaw("phone=?", $signin->phone)->first();
---
select * from `login` where phone=972658332 limit 1
select * from `admin` where phone='0972658332' limit 1