app/Http/Controllers/admin/order.php

    function updateorder(Request $request)
        {
            $orderId = $request->input('orderid');
            $isPaid = 'Chưa thanh toán';
            $isDelivered = 'Chưa giao hàng';

            if ($request->has('checkpayment')) { $isPaid = 'Đã thanh toán'; }

            if ($request->has('checkdeliver')) { $isDelivered = 'Thành công'; }

            DB::table("order")
                ->where("Order_Id", $orderId)
                ->update([
                    "Is_Paid" => $isPaid,
                    "Is_Delivered" => $isDelivered
                ]);

            return redirect()->route('order.main')->with('status', 'CẬP NHẬT TRẠNG THÁI ĐƠN HÀNG THÀNH CÔNG!');
---
update `order` set `Is_Paid` = 'Đã thanh toán', `Is_Delivered` = 'Chưa giao hàng' where `Order_Id` = 'O20'
SELECT o.Order_Id, o.Cus_Phone, o.Cus_Name, o.Recipient_Name, o.Recipient_Phone, o.Recipient_Email,
CONCAT_WS(', ', o.Recipient_Address, o.Recipient_Ward, o.Recipient_District, o.Recipient_Province_City) AS Recipient_AddressR,
o.Staff_Id, o.Create_Date, o.Payment_Code, o.Note, o.Is_Paid, o.Is_Delivered,
GROUP_CONCAT(od.Pd_Name SEPARATOR ', ') AS Product_Names,
SUM(od.Quantity) AS Total_Quantity,
SUM(od.AfterPrm_Total) AS Total_Money
FROM `order` o
JOIN order_detail od ON o.Order_Id = od.Order_Id GROUP BY o.Order_Id, o.Cus_Phone, o.Cus_Name, o.Recipient_Name, o.Recipient_Phone, o.Recipient_Email,
o.Recipient_Address, o.Recipient_Ward, o.Recipient_District, o.Recipient_Province_City, o.Staff_Id,
o.Create_Date, o.Payment_Code, o.Note, o.Is_Paid, o.Is_Delivered

    function delorder($id)
        {
            DB::table("order_detail")->where("Order_Id", $id)->delete();
            DB::table("order")->where("Order_Id", $id)->delete();

            return redirect()->route('order.main')->with('status', 'XÓA THÀNH CÔNG!');
---
SELECT o.Order_Id, o.Cus_Phone, o.Cus_Name, o.Recipient_Name, o.Recipient_Phone, o.Recipient_Email,
CONCAT_WS(', ', o.Recipient_Address, o.Recipient_Ward, o.Recipient_District, o.Recipient_Province_City) AS Recipient_AddressR,
o.Staff_Id, o.Create_Date, o.Payment_Code, o.Note, o.Is_Paid, o.Is_Delivered,
SUM(od.AfterPrm_Total) AS Total_Money
FROM `order` o
JOIN order_detail od ON o.Order_Id = od.Order_Id
GROUP BY o.Order_Id, o.Cus_Phone, o.Cus_Name, o.Recipient_Name, o.Recipient_Phone, o.Recipient_Email,
o.Recipient_Address, o.Recipient_Ward, o.Recipient_District, o.Recipient_Province_City, o.Staff_Id,
o.Create_Date, o.Payment_Code, o.Note, o.Is_Paid, o.Is_Delivered