app/Http/Controllers/admin/others.php

select * from `promotion` where `Prm_Id` = 'KM08' limit 1
---
    function formupdateprom($id)
        {
            $prom = DB::table('promotion')
            ->where('Prm_Id', $id)
            ->first();

update `promotion` set `Prm_Id` = 'KM03', `Prm_Name` = 'Merry Christmas', `Prm_Desc` = 'Đặt trước hóa đơn trên 200K tặng bánh quy gừng và thiệp Giáng sinh (trị giá 65K).', `dieukien` = 'Hóa đơn trên 200K (đặt trước).', `Prm_StDate` = '2023-12-24', `Prm_EnDate` = '2023-12-25', `Prm_Status` = 'Kết thúc' where `Prm_Id` = 'KM03'
---
    function updateprom(Request $request)
        {
            $id = $request->input('idprom');
            $name = $request->input('nameprom');
            $descr = $request->input('descrprom');
            $condition = $request->input('requireprom');
            $start = $request->input('datestart');
            $end = $request->input('dateend');
            $status = $request->input('statusprom');

            $data = [
                'Prm_Id' => $id,
                'Prm_Name' => $name,
                'Prm_Desc' => $descr,
                'dieukien' => $condition,
                'Prm_StDate' => $start,
                'Prm_EnDate' => $end,
                'Prm_Status' => $status,
            ];

            DB::table("promotion")->where("Prm_Id", $data["Prm_Id"])->update($data);

delete from `promotion` where `Prm_Id` = 'KM11'
---
    function delprom($id)
        {
            DB::table("promotion")->where("Prm_Id", $id)->delete();

select * from `blog` where `stt` = '1' limit 1
---
    function formupdateblog($id)
        {
            $blog = DB::table('blog')
                        ->where('stt', $id)
                        ->first();

select max(`ID`) as aggregate from `aboutus`
---
    function formaddabus()
        {
            $latestAbus = DB::table('aboutus')->max('ID');

insert into `aboutus` (`ID`, `Title`, `Content`) values ('10', 'Twitter', 'lalala')
---
    function addabus(Request $request)
        {
            $id = $request->input('id');
            $title = $request->input('title');
            $content = $request->input('content');

            $data = [
                'ID' => $id,
                'Title' => $title,
                'Content' => $content,
            ];

            DB::table("aboutus")->insert($data);