app/Http/Controllers/admin/product.php

function formaddpro()
    {
        $latestProduct = DB::table('product')->orderBy('masp', 'desc')->first();
---
select * from `product` order by `masp` desc limit 1

function formupdatepro($id)
    {
        $pro = DB::table('product')
                    ->where('masp', $id)
                    ->first();
---
select * from `product` where `masp` = 'P09' limit 1

function updatepro(Request $request)
    {
        $id = $request->input('idpro');
        $type = $request->input('typepro');
        $name = $request->input('namepro');
        $ingre = $request->input('ingrepro');
        $price = $request->input('pricepro');

        if ($request->hasFile('imgpro'))
        {
            $image = $request->file('imgpro');
            $imgName = $image->getClientOriginalName();
            $image->storeAs('public/images', $imgName);
        }
        else
        {
            $imgName = $request->input('imgName');
        }

        $data = [
            'masp' => $id,
            'tenlb' => $type,
            'tensp' => $name,
            'nglieu' => $ingre,
            'giaban' => $price,
            'hinhanh' => $imgName,
        ];

        DB::table("product")->where("masp", $data["masp"])->update($data);
---
update `product` set `masp` = 'P07', `tenlb` = 'Tiramisu', `tensp` = 'Tiramisu truyền thống 16cm', `nglieu` = 'Cà phê, cacao và rượu Rhum', `giaban` = '350000', `hinhanh` = 'traditional_tira.jpg' where `masp` = 'P07'